#include "kict_lib.h"

/**************************************************************
부저 비프음 울리기
***************************************************************
본 예제코드는 메이크에듀보드의 내장 피에조 부저를 이용하여
비프음을 내는 예제코드입니다.
사용함수는 buzzer(울림시간, 쉬는시간); 입니다.
메이커에듀보드에 내장된 부저는 D4번핀에 연결되어 있습니다.
예제코드를 올려서 1초간격으로 울리는 부저음을 확인해 보세요
**************************************************************/
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void setup() 
{// put your setup code here, to run once:
  default_Servoinit(0);  //사용할 서보모터 개수 초기화
  makeInit(4);           //고정핀 셋업(버저핀4,왼쪽모터 6,9, 오른쪽모터 3,5 멜로디 템포 4)
  delay(1000);
}

void loop() 
{// put your main code here, to run repeatedly:
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


while(1)                    //{   }에 포함된 코드를 무한반복하겠음
{                           //while의 중괄호 시작
  buzzer(500,500);          // 0.5초 울리고 0.5초 쉬기
}                           //while의 중괄호 마침





 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  finish();                 
}
