#include "kict_lib.h"

/**************************************************************
13번 LED 깜빡이기
***************************************************************
본 예제코드는 13번 LED를 1초 간격으로 무한히 깜빡이게 하는
예제코드입니다.
13번 LED는 아두이노 나노에 내장되어 있습니다.
예제코드를 올려서 깜빡이는 LED를 찾아보세요
**************************************************************/
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void setup() 
{// put your setup code here, to run once:
  default_Servoinit(0);  //사용할 서보모터 개수 초기화
  makeInit(4);           //고정핀 셋업(버저핀4,왼쪽모터 6,9, 오른쪽모터 3,5 멜로디 템포 4)
  delay(1000);
}

void loop() 
{// put your main code here, to run repeatedly:
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


while(1)                    //{   }에 포함된 코드를 무한반복하겠음
{                           //while의 중괄호 시작
  digitalWrite(13,HIGH);    //13번 LED 켜기
  delay(1000);              //1초 기다리기
  digitalWrite(13,LOW);     //13번 LED 끄기
  delay(1000);              //1초 기다리기
}                          //while의 중괄호 마침





 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  finish();                 
}
